app/controllers/books_controller.rb

  def home
    @books = Book.all
---
SELECT "books".* FROM "books"

  def book
    @book = Book.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

  def newBook
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("Book_ID", "Book_Title", "Author", "Publishers", "Year", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def create
    @book = Book.new(book_params)

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("Book_ID", "Book_Title", "Author", "Publishers", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["Book_ID", 3], ["Book_Title", ""], ["Author", ""], ["Publishers", ""], ["created_at", "2021-11-16 03:56:41.734305"], ["updated_at", "2021-11-16 03:56:41.734305"]]

  def update
    book = Book.find(params[:id])
                if book.update(book_params)
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "books" SET "Book_Title" = ?, "Author" = ?, "Publishers" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["Book_Title", "Introduction to Data Structures"], ["Author", "Tushar Kumar Patni"], ["Publishers", "NIT CALICUT"], ["updated_at", "2021-11-16 10:31:27.016841"], ["id", 3]]